"""07 Сравнение матриц

Напишите программу, которая
- обрабатывает две квадратные матрицы одинакового размера
- и проверяет, совпадают ли их диагональные элементы.

Данные:
matrix1 = [
    [1, 2, 3],
    [4, 5, 6],
    [7, 8, 9]
]
matrix2 = [
    [1, 0, 3],
    [0, 5, 0],
    [7, 0, 9]
]

Пример вывода:
Совпадают ли главные диагонали: True
Совпадают ли побочные диагонали: True
"""

matrix1 = [
    [1, 2, 3],
    [4, 5, 6],
    [7, 8, 9]
]
matrix2 = [
    [1, 0, 3],
    [0, 5, 0],
    [7, 0, 9]
]

