""" 01 Сумма цифр числа

Напишите рекурсивную функцию, которая находит сумму всех цифр числа.

Попробуйте решить в двух вариантах: tail и non-tail.

Данные:
num = 43197
Пример вывода:
24
"""

def sum_digits_tail(num):
    pass


def sum_digits_non_tail(num, accumulator=0):
    pass


print(sum_digits_tail(43197))       # 24
print(sum_digits_non_tail(43197))   # 24
