""" 02 Список студентов по факультетам

Напишите программу, которая
- принимает список студентов и их факультетов (тюплы)
- и группирует студентов по факультетам в словарь.

Данные:
students = [
    ("Иван", "Физика"),
    ("Мария", "Математика"),
    ("Пётр", "Физика"),
    ("Анна", "Математика"),
    ("Олег", "Информатика"),
    ("Наталья", "Физика"),
]

Пример вывода:
Факультеты и студенты:

faculties_and_students = {
    'Физика': ['Иван', 'Пётр', 'Наталья'],
    'Математика': ['Мария', 'Анна'],
    'Информатика': ['Олег'],
}

"""

from collections import defaultdict

students = [
    ("Иван", "Физика"),
    ("Мария", "Математика"),
    ("Пётр", "Физика"),
    ("Анна", "Математика"),
    ("Олег", "Информатика"),
    ("Наталья", "Физика"),
]

sample = {
    'Физика': ['Иван', 'Пётр', 'Наталья'],
    'Математика': ['Мария', 'Анна'],
    'Информатика': ['Олег'],
}


def get_faculties_and_students(students):
    pass


print(get_faculties_and_students(students))
print(get_faculties_and_students(students) == sample)
# {'Физика': ['Иван', 'Пётр', 'Наталья'], 'Математика': ['Мария', 'Анна'], 'Информатика': ['Олег']}
# True

