""" 02 Одинаковые элементы

Напишите программу, которая
- принимает два списка чисел
- и выводит список, содержащий элементы, присутствующие в обоих списках (без повторений!).

Данные:
list1 = [1, 2, 3, 4, 5]
list2 = [3, 4, 5, 6, 7]

Пример вывода:
Элементы в обоих списках: [3, 4, 5]
"""

list1 = [1, 2, 3, 4, 5]
list2 = [3, 4, 5, 6, 7]

print("Элементы в обоих списках:", ...)