"""О1 Определение типа объекта

Напишите программу, которая:
- Запрашивает у пользователя путь.
- Определяет, является ли путь файлом, папкой или он не существует.

Пример ввода:
Введите путь: example.txt

Пример вывода:
Путь <asdfasf> не существует
Путь <.> - папка
Путь <./practice_work_01.py> - файл
Путь <practice_work_01.py> - файл
"""
import os

def what_is_this(path):
    pass


print(what_is_this('asdfasf'))
print(what_is_this('solutions2'))
print(what_is_this('practice_work_01.py'))
print(what_is_this('practice_work_01.py'))