""" 01 Уникальные символы

Напишите программу, которая
- создает список из всех уникальных символов строки, за исключением пробелов.

Данные:
text = "hello world"
Пример вывода:
Уникальные символы: ['l', 'r', 'd', 'h', 'o', 'w', 'e']
"""

text = "hello world"

print("Уникальные символы:", ...)