""" 03 Глубина вложенности списка

Напишите рекурсивную функцию, которая
- определяет максимальную глубину вложенности списка.

Функция должна проверять:
- Аргумент должен быть списком.
- Вложенные структуры, если они есть, также должны быть списками.
- Если данные не валидны необходимо выбрасывать исключение.

При вызове функции обработайте возможное исключение.

Данные:
nested_list = [1, [2, [3, [4, [5]]]], 6, [[7, 8], 9]]

Пример вывода:
Максимальная глубина: 5
"""

def max_depth(data):
    pass

try:
    pass
except ...:
    pass
