""" 5. Очередь с ограничением времени

Реализуйте функцию, которая
- принимает очередь задач с указанием
    - времени их выполнения
    - и лимит.

Критерий отбора:
 - стараться оставить самые долгие задачи
 - но при этом максимально точно уложиться в лимит.


Данные:
tasks = {"task1": 5, "task2": 3, "task3": 7, "task4": 2}
time_limit = 10

Пример вывода:
time_limit = 10:
{'task3': 7, 'task2': 3}

time_limit = 12
{'task3': 7, 'task1': 5}

time_limit = 14
{'task3': 7, 'task1': 5, 'task4': 2}
"""

def filter_tasks_by_time(d: dict[str, int], t: int) -> dict[str, int]:
    sorted_tasks = sorted(d.items(), key=lambda x: x[1], reverse=True)

    total_time = 0

    result = {}

    for k, v in sorted_tasks:
        if total_time + v > t:
            continue

        result[k] = v
        total_time += v

    return result




sample_10 = {'task3': 7, 'task2': 3}
sample_12 = {'task3': 7, 'task1': 5}
sample_14 = {'task3': 7, 'task1': 5, 'task4': 2}

tasks = {"task1": 5, "task2": 3, "task3": 7, "task4": 2}

result_10 = filter_tasks_by_time(tasks, 10)
print(result_10 == sample_10)

result_12 = filter_tasks_by_time(tasks, 12)
print(result_12 == sample_12)

result_14 = filter_tasks_by_time(tasks, 14)
print(result_14 == sample_14)
