""" 7*. Поиск максимального элемента

Отсортируйте слова в списке исходя из суммы порядковых номеров всех символов в слове.
К примеру "kiwi" = ord("k") + ord("i") + ord("w") + ord("i") = 107 + 105 + 119 + 105 = 436.
Попробуйте решить в одну строку с помощью lambda и функций высшего порядка.

Данные:
words = ["banana", "kiwi", "grapefruit", "apple"]
Пример вывода:
['kiwi', 'apple', 'banana', 'grapefruit']



СПОСОБ РЕШЕНИЯ

Попробуйте решить поэтапно:

1. Найдите сумму порядковых номеров всех символов в одном слове.

2 Напишите функцию, которая сортирует слова по длине.

3 Замените сортировку по длине на сортировку по сумме порядковых номеров"""


from typing import Callable


words = ["banana", "kiwi", "grapefruit", "apple"]


# lambda
result = sorted(words, key=lambda x: sum(ord(c) for c in x))
print("Сортировка по сумме через lamda:", result)

# func
def sort_by_sum(x: str) -> int:
    return sum(ord(c) for c in x)


# функция сортировки по длине
def sort_custom(
        words: list[str], 
        f: Callable[[str], int] = lambda x: len(x)
) -> list[str]:
    return sorted(words, key=f)

print("Сортировка по длине:", sort_custom(words))

print("Сортировка по сумме:", sort_custom(words, sort_by_sum))
